Show / Hide Table of Contents
Enum ResultType
Type of results
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public enum ResultType
Fields
 Name |  Description
 CrossSectionMesh
Mesh on cross-section
 CrossSectionNLA
NLA on cross-section
 CrossSectionTA
TA on cross-section
 Deformation
Deformation
 InteractionDiagram
Interaction digaram on section
 InternalForces
Internal forces
 Improve this Doc
 View Source